In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {'Company':['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'], 
       'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
       'Sales': [200,120,340,124,243,350]}

In [4]:
df = pd.DataFrame(data)

In [5]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [9]:
byComp = df.groupby('Company')

In [13]:
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [14]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [18]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64